<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">Oracle Instant Client</h1>


<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<h3>Oracle Instant Client.</h3>
<p><strong>&#1054;&#1075;&#1083;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;</strong><br>
1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;.<br>
2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; Instant Client.<br>
2.1. &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; Instant Client.<br>
2.2. &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072; Instant Client.<br>
2.3. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; (PATH, TNS_ADMIN, NLS_LANG).<br>
3. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; Instant Client.</p>
<p><strong>1. &#1042;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;.</strong></p>
<p>Oracle Instant Client &mdash; &#1085;&#1072;&#1073;&#1086;&#1088; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090; &#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089; &#1057;&#1059;&#1041;&#1044; Oracle (&#1095;&#1077;&#1088;&#1077;&#1079; OCI, OCCI, Pro*C, ODBC, JDBC), &#1073;&#1077;&#1079; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072;.<br>
&#1054;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;:<br>
http://www.oracle.com/technetwork/database/features/instant-client/index-100365.html</p>
<p><strong>2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; Instant Client.</strong><br>
&#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1085;&#1072; &#1084;&#1072;&#1096;&#1080;&#1085;&#1091; &#1073;&#1077;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1081; Oracle:<br><strong>2.1. &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; Instant Client.</strong><br>
&#1057;&#1082;&#1072;&#1095;&#1072;&#1090;&#1100; &#1089; &#1089;&#1072;&#1081;&#1090;&#1072; Oracle &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1087;&#1072;&#1082;&#1077;&#1090; Instant Client Package (instantclient-basic-xxx &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; 10.2.0.5 (&#1076;&#1083;&#1103; 8.5.5.0 &#1080; 8.5.6.0) &#1080;&#1083;&#1080; 11.2.0.2.0 (&#1076;&#1083;&#1103; 8.5.6.0)) &#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; SQL*Plus &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089; &#1041;&#1044; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1080;&#1083;&#1080; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1080; (instantclient-sqlplus-xxx).<br><strong>2.2. &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1082;&#1072; Instant Client.</strong><br>
&#1048;&#1079;-&#1087;&#1086;&#1076; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1087;&#1088;&#1072;&#1074;&#1072;&#1084;&#1080; &#1072;&#1076;&#1084;&#1080;&#1085;&#1080;&#1089;&#1090;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1088;&#1072;&#1079;&#1072;&#1088;&#1093;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; &#1073;&#1077;&#1079; &#1089;&#1087;&#1077;&#1094;&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1080; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1086;&#1074;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, C:\ORACLE\INSTANT<br><strong>2.3. &#1055;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; (PATH, TNS_ADMIN, NLS_LANG).</strong><br>
1. &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1074; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; PATH:<br>
CMD&gt;SET PATH=C:\ORACLE\INSTANT;%path%</p>
<p>&#1069;&#1090;&#1080;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1086;&#1081; OCI &#1080; Oracle Net &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; (Easy Connect Naming).</p>
<p>2. &#1044;&#1083;&#1103; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1085; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1095;&#1077;&#1088;&#1077;&#1079; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; TNS_ADMIN (&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102;):<br>
CMD&gt;SET TNS_ADMIN=C:\ORACLE\INSTANT10<br>
&#1080; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; tnsnames.ora &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; C:\ORACLE\INSTANT10;<br>
(&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; tnsnames.ora &#1080;&#1097;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; &#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; TNS_ADMIN. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1072;, &#1090;&#1086; tnsnames.ora &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077; %ORACLE_HOME%\network\admin, &#1090;.&#1077;. &#1085;&#1091;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103; ORACLE_HOME &#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1091;&#1102; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1091; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;).</p>
<p>3. &#1044;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1076;&#1083;&#1103; Oracle &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; NLS_LANG:<br>
CMD&gt;SET NLS_LANG=AMERICAN_AMERICA.CL8MSWIN1251</p>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1103;:<br>
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1082;&#1088;&#1091;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1080;&#1079; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;&#1072;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; Oracle &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1085;&#1091;&#1078;&#1085;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1077;&#1077;&#1089;&#1090;&#1088;.</p>
<p><strong>3. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1080;&#1074;&#1072;&#1090;&#1085;&#1086;&#1075;&#1086; Instant Client.</strong><br>
&mdash; &#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1091;&#1081;&#1090;&#1077; &#1072;&#1088;&#1093;&#1080;&#1074; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; &#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084;.<br>
&mdash; &#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1092;&#1072;&#1081;&#1083; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; tnsnames.ora &#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089; &#1041;&#1044; &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1087;&#1072;&#1087;&#1082;&#1077;.</p>
<p><a href="/uploads/2012/09/image0011.jpg"><img class="alignnone wp-image-220" title="image001" src="/uploads/2012/09/image0011.jpg" alt="" width="561" height="356"></a></p>
<p>&mdash; &#1057;&#1086;&#1079;&#1076;&#1072;&#1081;&#1090;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1091;&#1102; &#1080;&#1083;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; NLS_LANG=AMERICAN_AMERICA.CL8MSWIN1251</p>
<p><a href="/uploads/2012/09/image0021.jpg"><img class="alignnone size-full wp-image-221" title="image002" src="/uploads/2012/09/image0021.jpg" alt="" width="237" height="262"></a><a href="/uploads/2012/09/image0031.jpg"><img class="alignnone size-full wp-image-222" title="image003" src="/uploads/2012/09/image0031.jpg" alt="" width="230" height="254"></a></p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
