<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1053;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; lob</h1>


<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1054;&#1096;&#1080;&#1073;&#1082;&#1072;: &nbsp;&#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090; lob &#1074; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077; PARUS_MAIN.</p>
<p><a href="/uploads/2012/10/lob_add.jpg"><img class="size-full wp-image-243 alignnone" title="lob_add" src="/uploads/2012/10/lob_add.jpg" alt="" width="474" height="249"></a></p>
<p>&#1058;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;&nbsp;PARUS_MAIN &mdash;&nbsp;smallefile &nbsp;&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1074; 32G.</p>
<p>&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;: &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;&nbsp;PARUS_MAIN&nbsp;&#1092;&#1072;&#1081;&#1083; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;:</p>
<pre class="lang:plsql  ">-- &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;&nbsp;&#1092;&#1072;&#1081;&#1083;
ALTER TABLESPACE PARUS_MAIN ADD DATAFILE 'D:\FRS\PARUS_MAIN2.DAT' SIZE 128M;
</pre>
<p>&#1058;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; smallfile &ndash; &#1101;&#1090;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1088;&#1099;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;. &#1042; &#1090;&#1072;&#1082;&#1080;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072;&#1093;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1079; 2^22 &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1092;&#1072;&#1081;&#1083; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1081; &#1073;&#1083;&#1086;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086; 8K, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1074; 32GB. &#1058;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1076;&#1086; 1022 &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>
<p>&#1053;&#1086;&#1074;&#1086;&#1077; &#1074; Oracle 10g, &#1101;&#1090;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1089; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; (bigfile). &#1058;&#1072;&#1082;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1086;&#1089;&#1090;&#1088;&#1077;&#1085;&#1099; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1083;&#1080; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;. &#1052;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1076;&#1086; 2^32 &#1073;&#1083;&#1086;&#1082;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086; 8K, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; &#1076;&#1086; 32TB.<br>
&#1058;&#1072;&#1082;&#1080;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1086;&#1090;&#1085;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082;, &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1090;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;.</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
