<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">CURSOR_SHARING</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1044;&#1083;&#1103; &#1101;&#1082;&#1086;&#1085;&#1086;&#1084;&#1080;&#1080; &#1084;&#1077;&#1089;&#1090;&#1072; SGA (shared_pool) &#1080; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1089;&#1093;&#1086;&#1076;&#1086;&#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1085;&#1072; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&nbsp;<strong>cursor_sharing = FORCE</strong>, &#1083;&#1080;&#1073;&#1086;&nbsp;<strong>cursor_sharing = SIMILAR</strong></p>
<pre class="lang:plsql">alter session set cursor_sharing=exact;
alter session set events '10046 trace name context forever, level 12';

-- &#1058;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1091;&#1077;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; P_FIN_SRZP_ITOGSVOD
begin
P_FIN_SRZP_ITOGSVOD (37576, 224967884);
end;

</pre>
<pre class="lang:plsql">alter session set cursor_sharing=force;
alter session set events '10046 trace name context forever, level 12';

-- &#1058;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1091;&#1077;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1091; P_FIN_SRZP_ITOGSVOD
begin
P_FIN_SRZP_ITOGSVOD (37576, 224967884);
end;

</pre>
<div>&#1042; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; FORCE sql &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&nbsp;&#1088;&#1072;&#1079;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 1 &#1088;&#1072;&#1079;.</div>
<div>&#1055;&#1088;&#1080; &#1087;&#1088;&#1086;&#1095;&#1080;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1089;ursor_sharing, &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1075;&#1083;&#1103;&#1076;&#1085;&#1086; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; shared pool. &#1048; &#1074;&#1089;&#1077; &#1089;&#1077;&#1089;&#1089;&#1080;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1083;&#1072;&#1085; &#1101;&#1090;&#1086;&#1075;&#1086; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;, &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1087;&#1083;&#1072;&#1085;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;, &#1072; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &ndash; &#1084;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;. &#1057;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1083;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1073;&#1086;&#1088;&#1086;&#1074; (&#1086;&#1085;&#1080; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081;). &#1040; &#1101;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; (&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1088;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;, &#1082;&#1086;&#1085;&#1082;&#1091;&#1088;&#1077;&#1085;&#1094;&#1080;&#1103; &#1074; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1095;&#1085;&#1086;&#1084; &#1082;&#1077;&#1096;&#1077;, &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1091;&#1083;&#1072;,&hellip;), &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1072;&#1089;&#1090;&#1077;&#1090;.</div>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
