<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1062;&#1077;&#1083;&#1086;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; Oracle</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p><strong><span style="color: #339966;">DB_BLOCK_CHECKSUM</span></strong><br>
&#1055;&#1086; &#1091;&#1083;&#1086;&#1095;&#1072;&#1085;&#1080;&#1077;<strong><span style="color: #ff0000;"> TYPICAL</span></strong><br><strong><span style="color: #3366ff;">OFF | TYPICAL | FULL</span></strong></p>
<p><strong><span style="color: #339966;">DB_BLOCK_CHECKING</span></strong><br>
&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; <strong><span style="color: #ff0000;">OFF</span></strong><br><strong><span style="color: #3366ff;">OFF | LOW | MEDIUM | FULL</span></strong></p>
<p>&#1058;&#1086;&#1084; &#1050;&#1072;&#1081;&#1090;:<br><strong>DB_BLOCK_CHECKSUM</strong>-&#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1090;&#1077; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086;. &#1055;&#1086;&#1084;&#1086;&#1075;&#1072;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1074;&#1074;&#1086;&#1076;&#1072;-&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; (&#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1076;&#1080;&#1089;&#1082;, &#1087;&#1083;&#1086;&#1093;&#1086;&#1081; &#1082;&#1072;&#1073;&#1077;&#1083;&#1100;, &#1087;&#1083;&#1086;&#1093;&#1080;&#1077; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;), &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; (bad interaction between Oracle and file system drivers, logical volume manager, raid software, whatever). &#1053;&#1086; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;, &#1095;&#1090;&#1086; &#1073;&#1083;&#1086;&#1082; &#1073;&#1099;&#1083; &#1091;&#1078;&#1077; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080; ( &#1087;&#1083;&#1086;&#1093;&#1080;&#1077; &#1095;&#1080;&#1087;&#1099; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1087;&#1083;&#1086;&#1093;&#1086;&#1077; &#1087;&#1079;). &#1055;&#1086;&#1083;&#1077;&#1079;&#1085;&#1072; &#1087;&#1088;&#1080; &#1087;&#1086;&#1080;&#1089;&#1082;&#1077; &#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1099;&#1093; &#1076;&#1080;&#1089;&#1082;&#1086;&#1074;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;:<br>
&#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1091;&#1084;&#1084;&#1072; &#1076;&#1083;&#1103; &#1075;&#1088;&#1103;&#1079;&#1085;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072;<br>
&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1091;&#1084;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1073;&#1083;&#1086;&#1082;<br>
&#1073;&#1083;&#1086;&#1082; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;<br>
&#1087;&#1086;&#1079;&#1078;&#1077; &#1073;&#1083;&#1086;&#1082; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;<br>
&#1089;&#1085;&#1086;&#1074;&#1072; &#1088;&#1072;&#1089;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1091;&#1084;&#1084;&#1072; &#1080; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1080;&#1084;&#1077;&#1102;&#1097;&#1077;&#1081;&#1089;&#1103; &#1074; &#1073;&#1083;&#1086;&#1082;&#1077; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1086;&#1081;.</p>
<p><strong>DB_BLOCK_CHECKING</strong>&mdash; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085; &#1083;&#1080; &#1073;&#1083;&#1086;&#1082;. &#1069;&#1090;&#1072; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1072;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1086;&#1088;&#1072;&#1082;&#1083; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;, &#1090;&#1086; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;. &#1044;&#1083;&#1103; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099; &#1088;&#1077;&#1076;&#1086;-&#1092;&#1072;&#1081;&#1083;&#1099; &#1080;&#1083;&#1080; &#1095;&#1090;&#1086;-&#1090;&#1086; &#1077;&#1097;&#1077;. &#1061;&#1086;&#1090;&#1103; &#1101;&#1090;&#1086; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1089;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1093;&#1089;&#1103; &#1074; &#1087;&#1072;&#1084;&#1103;&#1090;&#1080;, &#1085;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099;. &#1058;&#1072;&#1082;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1073;&#1088;&#1086;&#1089;&#1082;&#1077; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103; &#1073;&#1080;&#1090; &#1074; &#1076;&#1083;&#1080;&#1085;&#1077; &#1087;&#1086;&#1083;&#1103; &mdash; &#1101;&#1090;&#1086; &#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1072;.</p>
<p>&#1069;&#1090;&#1080; &#1076;&#1074;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1074; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103;. &#1048; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1085;&#1086; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;, checksum &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1072;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;, block checking &mdash; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1093;.</p>
<p><strong>&#1044;&#1083;&#1103; Oracle 10g</strong><br><strong><span style="color: #339966;">DB_BLOCK_CHECKSUM = <span style="color: #ff0000;">FULL</span></span></strong><br><strong><span style="color: #339966;">DB_BLOCK_CHECKING = <span style="color: #ff0000;">FULL</span></span></strong></p>
<p>&#1080;&#1083;&#1080; &#1090;&#1086;&#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;</p>
<p><strong>&#1044;&#1083;&#1103; Oracle 11g</strong><br><strong><span style="color: #339966;">DB_ULTRA_SAFE=<span style="color: #ff0000;">DATA_AND_INDEX</span></span></strong></p>
<p><strong><span style="color: #339966;">DB_ULTRA_SAFE</span></strong> (&#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;):<br><strong><span style="color: #3366ff;">&bull; DB_BLOCK_CHECKING</span></strong><br><strong><span style="color: #3366ff;">&bull; DB_BLOCK_CHECKSUM</span></strong><br><strong><span style="color: #3366ff;">&bull; DB_LOST_WRITE_PROTECT</span></strong></p>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074;&#1083;&#1080;&#1103;&#1077;&#1090; &#1085;&#1072; &#1085;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091; CPU 1%-10%. &nbsp;&#1044;&#1072;&#1077;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1091;&#1102; &#1085;&#1072;&#1076;&#1077;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;.</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
