<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">ADRCI</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1056;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1076;&#1080;&#1072;&#1075;&#1085;&#1086;&#1089;&#1090;&#1080;&#1082;&#1080; (Automatic Diagnostic Repository &mdash; ADR).</p>
<p>ADR Command Interpreter (ADRCI). &#1048;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1076;&#1080;&#1072;&#1075;&#1085;&#1086;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072;&#1084;&#1080; &#1086;&#1073; &#1080;&#1085;&#1094;&#1080;&#1076;&#1077;&#1085;&#1090;&#1072;&#1093;.</p>
<p>&#1044;&#1080;&#1072;&#1075;&#1085;&#1086;&#1089;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; 11g &#1086;&#1095;&#1080;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1087;&#1091;&#1090;&#1077;&#1084; &#1092;&#1086;&#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; MMON.</p>
<p>&#1045;&#1089;&#1090;&#1100; &#1076;&#1074;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1080; &#1074; ADR. &#1054;&#1073;&#1072; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1095;&#1080;&#1089;&#1083;&#1091; &#1095;&#1072;&#1089;&#1086;&#1074;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; MMON &#1092;&#1086;&#1085;&#1077; &#1095;&#1080;&#1089;&#1090;&#1086;&#1082; &#1080;&#1089;&#1090;&#1077;&#1082;&#1096;&#1080;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; ADR.</p>
<p>LONGP_POLICY (&#1076;&#1086;&#1083;&#1075;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1099;&#1077;) &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; 365 &#1076;&#1085;&#1077;&#1081; &#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1074;&#1077;&#1097;&#1072;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1080;&#1089;&#1096;&#1077;&#1089;&#1090;&#1074;&#1080;&#1103; (Incidents) &#1080; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; Health Monitor.</p>
<p>SHORTP_POLICY (&#1082;&#1088;&#1072;&#1090;&#1082;&#1086;&#1089;&#1088;&#1086;&#1095;&#1085;&#1099;&#1077;) &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; 30 &#1076;&#1085;&#1077;&#1081; &#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1074;&#1077;&#1097;&#1080;, &#1082;&#1072;&#1082; &#1092;&#1072;&#1081;&#1083;&#1099; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; (trace) &#1080; &#1092;&#1072;&#1081;&#1083;&#1099; &#1103;&#1076;&#1088;&#1072; (core dump files)</p>
<p><strong><span style="color: #3366ff;">adrci</span></strong><br><strong><span style="color: #3366ff;">show control</span></strong><br><strong><span style="color: #339966;">DIA-48448: This command does not support multiple ADR homes</span></strong><br>
&#1045;&#1089;&#1083;&#1080; &#1091; &#1042;&#1072;&#1089; &#1085;&#1072; &#1093;&#1086;&#1089;&#1090;&#1077; &#1073;&#1086;&#1083;&#1077;&#1077; &#1086;&#1076;&#1085;&#1086;&#1081; &#1041;&#1044;, &#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089; &#1082;&#1072;&#1082;&#1086;&#1081; &#1073;&#1072;&#1079;&#1086;&#1081; &#1084;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1084;.<br><strong><span style="color: #3366ff;">show homes</span></strong></p>
<p><strong><span style="color: #3366ff;">set home diag/rdbms/tester/tester</span></strong></p>
<p>&#1053;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; 360 &#1095;&#1072;&#1089;&#1086;&#1074; (15 &#1076;&#1085;&#1077;&#1081;):</p>
<p><strong><span style="color: #3366ff;">set control (SHORTP_POLICY = 360)</span></strong><br><strong><span style="color: #3366ff;">set control (LONGP_POLICY = 360)</span></strong></p>
<p>&#1052;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102; &#1086;&#1095;&#1080;&#1089;&#1090;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <strong><span style="color: #339966;">purge</span></strong> &#1080;&#1079; ADRCI.<br>
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1084; &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1090;&#1088;&#1072;&#1089;&#1089;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1072;&#1088;&#1096;&#1077; 6 &#1076;&#1085;&#1077;&#1081; (&#1074; &#1084;&#1080;&#1085;&#1091;&#1090;&#1072;&#1093;).</p>
<p><strong><span style="color: #3366ff;">purge -age 8640 -type TRACE</span></strong></p>
<p>&#1052;&#1099; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; <strong><span style="color: #339966;">LAST_MANUPRG_TIME</span></strong> &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1072; &#1090;&#1077;&#1087;&#1077;&#1088;&#1100; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;.<br><strong><span style="color: #3366ff;">show control</span></strong></p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
