<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080;</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p align="center"><strong>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080;</strong></p>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099; sqlplus &#1080;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1086;&#1090; oracle- &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;.</p>
<p>sqlplus / as sysdba</p>
<p>&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086; &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; SQL &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084;:</p>
<p>SQL&gt; select log_mode from v$database;</p>
<p>&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; NOARCHIVELOG &nbsp;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1095;&#1090;&#1086; &#1072;&#1088;&#1093;&#1080;&#1074;&#1072;&#1094;&#1080;&#1080; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1072;.</p>
<p>&#1055;&#1077;&#1088;&#1077;&#1074;&#1077;&#1089;&#1090;&#1080; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; ARCHIVELOG &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072;&#1084;&#1080; &#1074; sql*plus (&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;):</p>
<p>SQL&gt; shutdown immediate;</p>
<p>SQL&gt; startup mount;</p>
<p>SQL&gt; alter database archivelog;</p>
<p>SQL&gt; alter database open;</p>
<p>&#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1072;&#1088;&#1093;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;.</p>
<p><span id="more-338"></span></p>
<p align="center"><strong>&#1057;&#1082;&#1088;&#1080;&#1087;&#1090; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1081; &#1082;&#1086;&#1087;&#1080;&#1080; &#1041;&#1044; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1097;&#1077;&#1081; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; archivelog</strong></p>
<p>&#1044;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; backup.cmd &#1089; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;:</p>
<p>@echo off</p>
<p>chcp 1251</p>
<p>rman target / @backup.script &gt; backup_%date%.log</p>
<p>exit</p>
<p>&#1047;&#1076;&#1077;&#1089;&#1100;&nbsp; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; rman ,&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090; backup.script &#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099; &#1074; &#1083;&#1086;&#1075; &#1092;&#1072;&#1081;&#1083; backup_%date%.log (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; backup_11.04.2013.log)</p>
<p>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1088;&#1103;&#1076;&#1086;&#1084; &#1078;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; backup.script &#1089; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;:</p>
<p>run {</p>
<p>CONFIGURE RETENTION POLICY TO REDUNDANCY 7;</p>
<p>CONFIGURE CONTROLFILE AUTOBACKUP ON;</p>
<p>CONFIGURE BACKUP OPTIMIZATION ON;</p>
<p>CONFIGURE DEVICE TYPE DISK BACKUP TYPE TO COMPRESSED BACKUPSET;</p>
<p>backup as compressed backupset database plus archivelog;</p>
<p>delete noprompt obsolete;</p>
<p>}</p>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; CONFIGURE RETENTION POLICY TO REDUNDANCY 7&nbsp; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1079;&#1073;&#1099;&#1090;&#1086;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100; &#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1099; &#1093;&#1086;&#1090;&#1080;&#1084; &#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1077;&#1084;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1093; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081; &#1041;&#1044;.</p>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; CONFIGURE CONTROLFILE AUTOBACKUP ON &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1073;&#1101;&#1082;&#1072;&#1087; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072;.</p>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; CONFIGURE BACKUP OPTIMIZATION ON &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1086;&#1087;&#1090;&#1080;&#1084;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1087;&#1088;&#1080; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1084; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080;.</p>
<p>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; CONFIGURE DEVICE TYPE DISK BACKUP TYPE TO COMPRESSED BACKUPSET&nbsp; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1089;&#1078;&#1072;&#1090;&#1080;&#1077; &#1080; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1102;&#1097;&#1072;&#1103;&#1089;&#1103; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084;.</p>
<p align="center"><strong>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&nbsp; &#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1097;&#1080;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081;.</strong></p>
<p>&#1042; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1084; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1084;&#1077;&#1085;&#1102; <em>&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;</em> &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; <strong>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091;. </strong>&#1042; &#1086;&#1082;&#1085;&#1077; <strong>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</strong> &#1074;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1086;&#1074;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; &#1080; &#1077;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;.&nbsp; &#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1089;&#1100; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <strong>&#1058;&#1088;&#1080;&#1075;&#1075;&#1077;&#1088;&#1099;</strong>, &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <em>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</em> &#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1100;&#1090;&#1077; &#1076;&#1072;&#1090;&#1091;, &#1074;&#1088;&#1077;&#1084;&#1103; &#1080; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1091; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;.</p>
<p>&nbsp;</p>
<p>&#1055;&#1077;&#1088;&#1077;&#1081;&#1076;&#1080;&#1090;&#1077; &#1085;&#1072; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1091; <strong>&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;</strong> &#1080; &#1085;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <em>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</em>.</p>
<p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1087;&#1083;&#1072;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1102;, &#1074; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; <em>&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;</em> &#1074;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; <strong>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</strong> &#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <em>&#1054;&#1073;&#1079;&#1086;&#1088;</em> &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;.&nbsp; &#1054;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1078;&#1080;&#1090;&#1077; <strong>&#1056;&#1072;&#1073;&#1086;&#1095;&#1091;&#1102; &#1087;&#1072;&#1087;&#1082;&#1091;.</strong></p>
<p>&nbsp;</p>
<p align="center"><strong>&#1054;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; RMAN.</strong></p>
<p>&#1044;&#1083;&#1103; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1072;&#1079;&#1099; &#1085;&#1091;&#1078;&#1085;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1099; RMAN &#1080;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1086;&#1090; oracle- &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; (&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;):</p>
<p>rman target /</p>
<p>Rman&gt; startup force mount;</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p>Rman&gt; restore database;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099;</p>
<p>Rman&gt; recover database;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1076;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;</p>
<p>Rman&gt; alter database open;</p>
<p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1074; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;.</p>
<p>&nbsp;</p>
<p align="center"><strong>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1072;&#1074;&#1090;&#1086;&#1073;&#1101;&#1082;&#1072;&#1087;&#1099; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093;</strong> <strong>&#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</strong> <strong>&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; </strong><strong>RMAN.</strong></p>
<p>rman target /</p>
<p>RMAN&gt; startup nomount;</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1077;&#1079; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p>RMAN&gt; restore controlfile from autobackup;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&nbsp; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</p>
<p>RMAN&gt; alter database mount;</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p>RMAN&gt; restore database;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099;</p>
<p>RMAN&gt; recover database;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1076;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;</p>
<p>RMAN&gt; alter database open resetlogs;</p>
<p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1074; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; resetlogs. &#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1087;&#1094;&#1080;&#1080; resetlogs &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1072;&#1088;&#1093;&#1080;&#1074;&#1085;&#1099;&#1093; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;.</p>
<p>&nbsp;</p>
<p align="center"><strong>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1041;&#1044; Oracle &#1085;&#1072; &#1085;&#1086;&#1074;&#1086;&#1084; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; RMAN.</strong></p>
<p>1. &nbsp;&#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1057;&#1059;&#1041;&#1044; Oracle</p>
<p>2. &#1053;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084; listener.ora</p>
<p>&mdash;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1055;&#1086;&#1089;&#1083;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; Oracle &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1080;&#1090;&#1100; &#1089;&#1083;&#1091;&#1078;&#1073;&#1091; Listener Oracle. &nbsp;&#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086;&nbsp; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1079;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; Net Configuration Assistance &#1080;&#1079; &#1084;&#1077;&#1085;&#1102; &#1087;&#1091;&#1089;&#1082; &#1080;&#1083;&#1080; netca &#1080;&#1079; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080;.</p>
<p>&mdash;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1042;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084; Add listener, &#1074; Listener name &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; Listener</p>
<p>&mdash;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1042;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; TCP .</p>
<p>&mdash;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1087;&#1086;&#1088;&#1090; 1521</p>
<p>&mdash;&nbsp;&nbsp;&nbsp; &#1086;&#1090;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1089;&#1103; &#1086;&#1090; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; Listener &#1080; &#1078;&#1084;&#1077;&#1084; finish</p>
<p>3. &#1053;&#1072;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1084; sqlnet.ora</p>
<p>&#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1092;&#1072;&#1081;&#1083; C:\app\product\11.2.0\dbhome_1\NETWORK\ADMIN \ sqlnet.ora &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1085;&#1077;&#1075;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;:</p>
<p>SQLNET.AUTHENTICATION_SERVICES = (NTS)</p>
<p>4. &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; &#1073;&#1072;&#1079;&#1099;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: C:\oradata\MURGB</p>
<p>5. &#1057;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; RMAN-&#1073;&#1101;&#1082;&#1072;&#1087;&#1099; &#1089; FRA. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: &#1074; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075; C:\FRA.</p>
<p>&#1046;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1082;&#1072;&#1082; &#1073;&#1099;&#1083;&#1086; &#1074; spfile, &#1095;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1091;&#1090;&#1080; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;.</p>
<p>6. &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1073;&#1072;&#1079;&#1091; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; MURGB &#1080; &#1089; &#1087;&#1072;&#1088;&#1086;&#1083;&#1077;&#1084; SYS:</p>
<p>oradim -new -sid MURGB -syspwd sys -startmode auto</p>
<p>7. &#1044;&#1072;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084;&#1089;&#1103; &#1082; RMAN &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099;:</p>
<p>RMAN TARGET /</p>
<p>&#1055;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; rman &#1080;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089; &#1087;&#1086;&#1083;&#1085;&#1086;&#1084;&#1086;&#1095;&#1080;&#1103;&#1084;&#1080; SYSDBA</p>
<p>RMAN&gt; SET DBID 2272089540</p>
<p>&#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>
<p>RMAN&gt; STARTUP FORCE NOMOUNT</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1077;&#1079; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1073;&#1077;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;</p>
<p>RMAN&gt; RESTORE SPFILE FROM &lsquo;C:\FRA\MURGB\AUTOBACKUP\2013_04_01\O1_MF_S_811592437_8OL9SQ0H_.BKP&rsquo;;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1091;&#1090;&#1080; &#1082; &#1073;&#1101;&#1082;&#1072;&#1087;&#1091;.</p>
<p>RMAN&gt; SHUTDOWN IMMEDIATE;</p>
<p>&#1054;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</p>
<p>RMAN&gt; STARTUP NOMOUNT;</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1073;&#1077;&#1079; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1092;&#1072;&#1081;&#1083; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</p>
<p>RMAN&gt; RESTORE CONTROLFILE FROM AUTOBACKUP;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&nbsp; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;</p>
<p>&#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1087;&#1091;&#1090;&#1100; &#1082; &#1072;&#1074;&#1090;&#1086;&#1073;&#1101;&#1082;&#1072;&#1087;&#1091; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1090;&#1086;:</p>
<p>RMAN&gt; RESTORE CONTROLFILE FROM &lsquo;C:\FRA\MURGB\AUTOBACKUP\2013_04_01\O1_MF_S_811592437_8OL9SQ0H_.BKP&rsquo;;</p>
<p>RMAN&gt; ALTER DATABASE MOUNT;</p>
<p>&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1073;&#1072;&#1079;&#1099; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1084;&#1086;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</p>
<p>&#1077;&#1089;&#1083;&#1080; &#1087;&#1091;&#1090;&#1100; &#1082; &#1073;&#1101;&#1082;&#1072;&#1087;&#1089;&#1077;&#1090;&#1091; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1090;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;:</p>
<p>RMAN&gt; CATALOG BACKUPPIECE &lsquo;C:\FRA\MURGB\BACKUPSET\2013_04_01\O1_MF_NNNDF_TAG20130401T101609_8OL9KB8S_.BKP&rsquo;;</p>
<p>RMAN&gt; LIST BACKUP;</p>
<p>&#1055;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1099;&#1093; &#1082;&#1086;&#1087;&#1080;&#1081;</p>
<p>RMAN&gt; RESTORE DATABASE;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099;</p>
<p>RMAN&gt; RECOVER DATABASE;</p>
<p>&#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1076;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080;</p>
<p>RMAN&gt; ALTER DATABASE OPEN RESETLOGS;</p>
<p>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1073;&#1072;&#1079;&#1099; &#1074; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1089; &#1086;&#1087;&#1094;&#1080;&#1077;&#1081; resetlogs. &#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1087;&#1094;&#1080;&#1080; resetlogs &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1072;&#1088;&#1093;&#1080;&#1074;&#1085;&#1099;&#1093; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072;.</p>
<p>&nbsp;</p>
<p><strong>&#1042;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;:</strong></p>
<p>&#1053;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; DBID:</p>
<p>RMAN&gt; LIST BACKUP;</p>
<p>RMAN-00571: ===========================================================</p>
<p>RMAN-00569: =============== ERROR MESSAGE STACK FOLLOWS ===============</p>
<p>RMAN-00571: ===========================================================</p>
<p>RMAN-03002: failure of list command at 04/05/2013 16:05:13</p>
<p>RMAN-06189: current DBID 2272089542 does not match target mounted database (2272</p>
<p>089540)</p>
<p>&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;: &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>
<p>RMAN&gt; SHUTDOWN IMMEDIATE</p>
<p>RMAN&gt; STARTUP NOMOUNT</p>
<p>RMAN&gt; SET DBID 2272089540</p>
<p>RMAN&gt; ALTER DATABASE MOUNT;</p>
<p>RMAN&gt; LIST BACKUP;</p>
<p>&nbsp;</p>
<p>&#1053;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1085;&#1080;&#1077; &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1072;&#1088;&#1093;&#1080;&#1074;&#1085;&#1099;&#1093; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082;:</p>
<p>RMAN&gt; RECOVER DATABASE;</p>
<p>RMAN-00571: ===========================================================</p>
<p>RMAN-00569: =============== ERROR MESSAGE STACK FOLLOWS ===============</p>
<p>RMAN-00571: ===========================================================</p>
<p>RMAN-03002: failure of recover command at 04/05/2013 15:51:34</p>
<p>RMAN-06054: media recovery requesting unknown archived log for thread 1 with sequence 1 and starting SCN of 2208740</p>
<p>&#1056;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;: &#1042;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1073;&#1072;&#1079;&#1091; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; 1.</p>
<p>RMAN&gt; RECOVER DATABASE UNTIL SEQUENCE 1;</p>
<p>&nbsp;</p>
<p><strong>&#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;:</strong></p>
<p>&#1057;&#1082;&#1088;&#1080;&#1087;&#1090; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1072; &#1076;&#1072;&#1090;&#1072; &#1080; &#1088;&#1077;&#1076;&#1086; &#1083;&#1086;&#1075; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; sqlplus:</p>
<p>SELECT FILE# AS &laquo;File/Grp#&raquo;, NAME FROM V$DATAFILE UNION</p>
<p>SELECT GROUP#,MEMBER FROM V$LOGFILE;</p>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1082;&#1088;&#1080;&#1087;&#1090;&#1072; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089; &#1085;&#1086;&#1074;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1073;&#1072;&#1079;&#1099; (SID) &#1080; &#1087;&#1091;&#1090;&#1103;&#1084;&#1080; &#1082; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1053;&#1086;&#1084;&#1077;&#1088;&#1072; datafile &#1091; &#1074;&#1089;&#1077;&#1093; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077;.</p>
<p>RMAN&gt; @C:\rman.txt</p>
<p>RMAN&gt; run{</p>
<p>set newname for datafile 1 to &lsquo;C:\ORADATA\MURGB\SYSTEM01.DBF&rsquo;;</p>
<p>set newname for datafile 2 to &lsquo;C:\ORADATA\MURGB\SYSAUX01.DBF&rsquo;;</p>
<p>set newname for datafile 3 to &lsquo;C:\ORADATA\MURGB\UNDOTBS01.DBF&rsquo;;</p>
<p>set newname for datafile 4 to &lsquo;C:\ORADATA\MURGB\SPR01.DBF&rsquo;;</p>
<p>set newname for datafile 5 to &lsquo;C:\ORADATA\MURGB\SPR_IND01.DBF&rsquo;;</p>
<p>set newname for datafile 6 to &lsquo;C:\ORADATA\MURGB\USERS01.DBF&rsquo;;</p>
<p>set newname for datafile 7 to &lsquo;C:\ORADATA\MURGB\USERS02.DBF&rsquo;;</p>
<p>set newname for datafile 8 to &lsquo;C:\ORADATA\MURGB\USERS03.DBF&rsquo;;</p>
<p>set newname for datafile 9 to &lsquo;C:\ORADATA\MURGB\USR_IND01.DBF&rsquo;;</p>
<p>set newname for datafile 10 to &lsquo;C:\ORADATA\MURGB\USR_IND02.DBF&rsquo;;</p>
<p>set newname for datafile 11 to &lsquo;C:\ORADATA\MURGB\USR_IND03.DBF&rsquo;;</p>
<p>SET UNTIL SCN 745212;</p>
<p>RESTORE DATABASE;</p>
<p>SWITCH DATAFILE ALL;</p>
<p>RECOVER DATABASE;</p>
<p>}</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
