<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1055;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; (SWITCHOVER) Data Guard (standby)</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p><strong>select name, open_mode, log_mode, switchover_status from v$database;</strong><br><strong>select max(sequence#) from v$log;</strong></p>
<p>&#1053;&#1072; STANDBY:<br><strong>select client_process, process, sequence#, status from v$managed_standby;</strong><br>
&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; redo current, &#1080; &#1074;&#1089;&#1077; redo &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1099; &#1073;&#1099;&#1083;&#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1099; &#1082; standby database.<br>
&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; <strong>MRP0</strong> &#1089; &#1090;&#1077;&#1084; &#1078;&#1077; sequence &#1073;&#1099;&#1083; &#1074; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1077; <strong>APPLYING_LOG</strong><br>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1085;&#1077; &#1074;&#1080;&#1076;&#1077;&#1090;&#1077; MRP0 line, &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1086;.<br>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089; WAIT_FOR_GAP, &#1090;&#1086;&#1075;&#1076;&#1072;, &#1042;&#1099; &#1085;&#1077;&#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; switch over, &#1087;&#1086;&#1082;&#1072; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1077;&#1096;&#1077;&#1085;&#1072;.<br>
&#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1074;&#1080;&#1076;&#1080;&#1090;&#1077; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089; WAIT_FOR_LOG, &#1090;&#1086;&#1075;&#1076;&#1072; &#1042;&#1099; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;&#1077; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;</p>
<p>&#1053;&#1072; PRIMARY<br><strong>alter system archive log current;</strong><br><strong>alter database commit to switchover to physical standby with session shutdown;</strong></p>
<p>&#1053;&#1072; STANDBY:<br><strong>alter database commit to switchover to primary with session shutdown;</strong><br><strong>alter database open;</strong></p>
<p>&#1053;&#1072; PRIMARY<br><strong>shutdown immediate;</strong><br><strong>quit</strong><br><strong>sqlplus / as sysdba</strong><br><strong>startup mount;</strong><br><strong>alter database recover managed standby database using current logfile disconnect;</strong></p>
<p>&#1053;&#1072; STANDBY:<br><strong>alter system switch logfile;</strong><br><strong>select max(sequence#) from v$log;</strong></p>
<p><strong>select name, open_mode, log_mode, switchover_status from v$database;</strong></p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
