<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1040;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074; Oracle</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p><strong><span style="color: #339966;">&#1040;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074; Oracle &mdash; &#1093;&#1086;&#1088;&#1086;&#1096;&#1072;&#1103; &#1074;&#1077;&#1097;&#1100;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1077;&#1089;&#1100;!</span></strong></p>
<p>&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1086;&#1076;&#1089;&#1095;&#1077;&#1090;&#1072; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1086;&#1081; &#1089;&#1091;&#1084;&#1084;&#1099; &#1079;&#1072;&#1088;&#1087;&#1083;&#1072;&#1090; &#1087;&#1086; &#1086;&#1090;&#1076;&#1077;&#1083;&#1072;&#1084; &nbsp;&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1072;&#1093;&nbsp;&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1080;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;:</p>
<pre class="lang:plsql">

--&#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;

SELECT ename, deptno, sal,
SUM(sal) OVER (ORDER BY deptno, ename) running_total,
SUM(sal) OVER (PARTITION BY deptno ORDER BY ename) department_total,
ROW_NUMBER() OVER (PARTITION BY deptno ORDER BY ename) seq
FROM scott.emp
ORDER BY deptno, ename

</pre>
<table border="1"><tbody><tr><td>ENAME</td>
<td>DEPTNO</td>
<td>SAL</td>
<td>RUNNING_TOTAL</td>
<td>DEPARTMENT_TOTAL</td>
<td>SEQ</td>
</tr><tr><td>CLARK</td>
<td>10</td>
<td>2450</td>
<td>2450</td>
<td>2450</td>
<td>1</td>
</tr><tr><td>KING</td>
<td>10</td>
<td>5000</td>
<td>7450</td>
<td>7450</td>
<td>2</td>
</tr><tr><td>MILLER</td>
<td>10</td>
<td>1300</td>
<td>8750</td>
<td>8750</td>
<td>3</td>
</tr><tr><td>ADAMS</td>
<td>20</td>
<td>1100</td>
<td>9850</td>
<td>1100</td>
<td>1</td>
</tr><tr><td>FORD</td>
<td>20</td>
<td>3000</td>
<td>12850</td>
<td>4100</td>
<td>2</td>
</tr><tr><td>JONES</td>
<td>20</td>
<td>2975</td>
<td>15825</td>
<td>7075</td>
<td>3</td>
</tr><tr><td>SCOTT</td>
<td>20</td>
<td>3000</td>
<td>18825</td>
<td>10075</td>
<td>4</td>
</tr><tr><td>SMITH</td>
<td>20</td>
<td>800</td>
<td>19625</td>
<td>10875</td>
<td>5</td>
</tr><tr><td>ALLEN</td>
<td>30</td>
<td>1600</td>
<td>21225</td>
<td>1600</td>
<td>1</td>
</tr><tr><td>BLAKE</td>
<td>30</td>
<td>2850</td>
<td>24075</td>
<td>4450</td>
<td>2</td>
</tr><tr><td>JAMES</td>
<td>30</td>
<td>950</td>
<td>25025</td>
<td>5400</td>
<td>3</td>
</tr><tr><td>MARTIN</td>
<td>30</td>
<td>1250</td>
<td>26275</td>
<td>6650</td>
<td>4</td>
</tr><tr><td>TURNER</td>
<td>30</td>
<td>1500</td>
<td>27775</td>
<td>8150</td>
<td>5</td>
</tr><tr><td>WARD</td>
<td>30</td>
<td>1250</td>
<td>29025</td>
<td>9400</td>
<td>6</td>
</tr></tbody></table><p>&#1069;&#1090;&#1086;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;.<br>
&#1054;&#1085; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086; &#1085;&#1086;&#1074;&#1099;&#1077; &#1087;&#1077;&#1088;&#1089;&#1087;&#1077;&#1082;&#1090;&#1080;&#1074;&#1099; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1075;&#1086;<br>
&#1086;&#1073;&#1098;&#1077;&#1084;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1076;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1080; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; (&#1080;&#1083;&#1080; &#1085;&#1077;&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1093;) &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1097;&#1080;&#1093; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1085;&#1072;<br>
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091;, &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1078;&#1077;&#1083;&#1072;&#1077;&#1084;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;.</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
