<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">SHRINK SPACE &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1089;&#1078;&#1072;&#1090;&#1080;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p><strong><span style="color: #008000;">&#1055;&#1086;&#1095;&#1077;&#1084;&#1091; &#1087;&#1086;&#1080;&#1089;&#1082; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1089; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1084; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1085;&#1103;&#1090;&#1100; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;?</span></strong></p>
<p>&#1045;&#1089;&#1083;&#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1082;&#1086;&#1075;&#1076;&#1072;-&#1090;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1087;&#1086;&#1080;&#1089;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1076;&#1083;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; Oracle &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1073;&#1083;&#1086;&#1082;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1086;&#1075;&#1076;&#1072;-&#1083;&#1080;&#1073;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1083;&#1080;&#1089;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &ndash; &#1074;&#1087;&#1083;&#1086;&#1090;&#1100; &#1076;&#1086; &#1084;&#1072;&#1088;&#1082;&#1077;&#1088;&#1072; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; (High Water Mark &ndash; HWM).<br><strong>&#1057;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1091;&#1089;&#1082;&#1086;&#1088;&#1080;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;:</strong><br>
1. drop and recreate (exp/imp)<br>
2. truncate (exp the data, truncate it, imp the data)<br>
3. alter TABLE move&nbsp;+ rebuild indexes<br>
4. SHRINK SPACE &mdash;&nbsp;Online Segment Shrink (&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1089;&#1078;&#1072;&#1090;&#1080;&#1077; &#1089;&#1077;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;)&nbsp; &#1087;&#1086;&#1103;&#1074;&#1080;&#1083;&#1072;&#1089;&#1100; &#1074; 10G<br>
5. DBMS_REDEFINITION</p>
<p><strong><span style="color: #0000ff;">ALTER TABLE &#1080;&#1084;&#1103;_&#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; SHRINK SPACE [COMPACT] [CASCADE];</span></strong><br>
&#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1081; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1073;&#1077;&#1079; &#1086;&#1087;&#1094;&#1080;&#1081; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1076;&#1077;&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080; &#1091;&#1087;&#1083;&#1086;&#1090;&#1085;&#1077;&#1085;&#1080;&#1102; &#1077;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;.<br>
&#1047;&#1072;&#1090;&#1077;&#1084; HWM &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082; &#1085;&#1086;&#1074;&#1086;&#1081; &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1080; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1080;&#1074;&#1096;&#1077;&#1077;&#1089;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086;.<br>
&#1054;&#1087;&#1094;&#1080;&#1103; COMPACT &#1087;&#1088;&#1086;&#1074;&#1086;&#1076;&#1080;&#1090; &#1076;&#1077;&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;, &#1085;&#1086; &#1085;&#1077; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; HWM.<br>
&#1054;&#1087;&#1094;&#1080;&#1103; CASCADE &#1089;&#1078;&#1080;&#1084;&#1072;&#1077;&#1090; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;, &#1085;&#1086; &#1080; &#1083;&#1102;&#1073;&#1099;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1099;.<br>
&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; ROWID,<br>
&#1042;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1083;&#1102;&#1073;&#1099;&#1077; &#1090;&#1088;&#1080;&#1075;&#1075;&#1077;&#1088;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1090; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; ROWID, &#1080;&#1083;&#1080; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;.<br>
&#1048;&#1084;&#1077;&#1102;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;: &#1087;&#1088;&#1086;&#1082;&#1086;&#1085;&#1089;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1081;&#1090;&#1077;&#1089;&#1100; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.</p>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089; TRUNCATE:</p>
<pre class="lang:plsql">
LOCK TABLE ZTABLE
IN EXCLUSIVE MODE
NOWAIT;
create table ZTABLE2 AS select t.* from ZTABLE t;
truncate table ZTABLE;
insert into ZTABLE select * from ZTABLE2;
commit;
commit;

</pre>
<p>&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074; SHRINK SPACE:</p>
<pre class="lang:plsql">--&#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1076;&#1086;
select round(bytes /1024/1024, 2) mb
from&nbsp;&nbsp; dba_segments
WHERE segment_name = upper('zrepl_msg_i');

alter table zrepl_msg_i enable row movement;
ALTER TABLE zrepl_msg_i SHRINK SPACE;
alter table zrepl_msg_i disable row movement;

--&#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077;
select round(bytes /1024/1024, 2) mb
from&nbsp;&nbsp; dba_segments
WHERE segment_name = upper('zrepl_msg_i');
</pre>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
