<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">HTTP &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; APEX</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; 3 &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1074;&#1103;&#1079;&#1080; &#1089; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1084; APEX.</p>
<p>1. <strong>Oracle Application Express Listener</strong> &ndash; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1083;&#1091;&#1096;&#1080;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086; &#1089;&#1083;&#1091;&#1078;&#1073;&#1086;&#1081; APEX, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1072; mod_plsql. &#1071;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1086;&#1081;, &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1097;&#1077;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;.<br>
2. <strong>Oracle HTTP Server (Apache) c mod_plsql</strong> &ndash; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; HTTP-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1089;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1083;&#1072;&#1075;&#1080;&#1085;&#1086;&#1084;. &#1054;&#1073;&#1072; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1090;&#1088;&#1077;&#1093;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1091;&#1102; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103;:</p>
<ul><li>&#1041;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;</li>
<li>Oracle Application Express Listener &#1080;&#1083;&#1080; Oracle HTTP Server (Apache) &#1089; mod_plsql</li>
<li>&#1041;&#1044; Oracle &#1089; Oracle Application Express</li>
</ul><p>&#1055;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1090;&#1072;&#1082;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; &#1041;&#1044; &#1080; &#1090;&#1088;&#1072;&#1085;&#1089;&#1087;&#1086;&#1088;&#1090;&#1085;&#1086;&#1081; &#1089;&#1083;&#1091;&#1078;&#1073;&#1099;, &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; Oracle Application Express.</p>
<p>3. <strong>&#1042;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1096;&#1083;&#1102;&#1079; PL/SQL (Embedded PL/SQL Gateway)</strong> &ndash; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; Oracle XML DB HTTP &#1089;&#1086; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1084; &#1096;&#1083;&#1102;&#1079;&#1086;&#1084; PL/SQL &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; Oracle Database 11g. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; Oracle &#1074;&#1077;&#1073;-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1084; &#1080; &#1074;&#1089;&#1077;&#1081; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1080;&#1085;&#1092;&#1088;&#1072;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1086;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1077;&#1073;-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1058;&#1072;&#1082;&#1086;&#1077; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1074;&#1091;&#1093;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1091;&#1102; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1091;</p>
<ul><li>&#1041;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;</li>
<li>&#1041;&#1044; Oracle &#1089; PL/SQL &#1096;&#1083;&#1102;&#1079;&#1086;&#1084; &#1080; Oracle Application Express</li>
</ul><p>&#1055;&#1088;&#1077;&#1080;&#1084;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1090;&#1072; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;. &#1058;.&#1082;. &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1072;&#1088;&#1093;&#1080;&#1090;&#1077;&#1082;&#1090;&#1091;&#1088;&#1072; &#1076;&#1074;&#1091;&#1093;&#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1074;&#1072;&#1103;, &#1090;&#1086; &#1085;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; &#1041;&#1044; &#1080; &#1087;&#1088;&#1086;&#1089;&#1083;&#1091;&#1096;&#1080;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1096;&#1083;&#1102;&#1079; &#1085;&#1077; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1080;&#1084; &#1096;&#1080;&#1088;&#1086;&#1082;&#1080;&#1084; &#1085;&#1072;&#1073;&#1086;&#1088;&#1086;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1082; &#1079;&#1072;&#1097;&#1080;&#1090;&#1099; &#1080; &#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1072;&#1082; &#1087;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1072;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091;, &#1085;&#1077; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1096;&#1083;&#1102;&#1079;&#1072; &#1076;&#1083;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; APEX-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1077;&#1090;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1085;&#1077;&#1090;.</p>
<p>&#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1072; &#1089; APEX &#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1090;&#1086; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1086;&#1097;&#1077;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1094;&#1077;&#1083;&#1077;&#1089;&#1086;&#1086;&#1073;&#1088;&#1072;&#1079;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; 3-&#1081; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; PL/SQL &#1096;&#1083;&#1102;&#1079;&#1072;.</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
