<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &#1080; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090; &#1076;&#1072;&#1084;&#1087;&#1072;</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &#1080; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090; &#1076;&#1072;&#1084;&#1087;&#1072; &#1089;&#1093;&#1077;&#1084;&#1099; oracle</p>
<p>Export &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1041;&#1044; &#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1089;&#1072;&#1084;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1086; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1073;&#1080;&#1085;&#1072;&#1088;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083;. &#1058;&#1072;&#1082;&#1086;&#1081; &#1092;&#1072;&#1081;&#1083; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;. &#1060;&#1072;&#1081;&#1083; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1086;&#1081; Import .</p>
<p><strong>BUFFER = &#1095;&#1080;&#1089;&#1083;&#1086;</strong>&nbsp;&ndash; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; (&#1074; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093;), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1088;&#1072;&#1074;&#1077;&#1085; &#1085;&#1091;&#1083;&#1102;, &#1090;&#1086; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;-&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;.</p>
<p><strong>FILE = &#1080;&#1084;&#1103;_&#1092;&#1072;&#1081;&#1083;&#1072;</strong>&nbsp;&ndash; &#1069;&#1090;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;. &#1055;&#1086;-&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; EXPDAT.DMP</p>
<p><strong>LOG = &#1080;&#1084;&#1103;_&#1092;&#1072;&#1081;&#1083;&#1072;</strong>&nbsp;&ndash; &#1047;&#1076;&#1077;&#1089;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1074;&#1089;&#1103; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;. &#1042; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1099; &#1074;&#1089;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1089;&#1077; &#1101;&#1090;&#1080; &#1078;&#1077; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;.</p>
<p><strong>IGNORE = [Y &#1080;&#1083;&#1080; N]</strong>&nbsp;&ndash; &#1069;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1097;&#1080;&#1093; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; IGNORE = Y &#1080; &#1087;&#1088;&#1080; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091;&#1078;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1072;&#1103;&#1089;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072;, &#1090;&#1086; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1085;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;, &#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1101;&#1090;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1102;&#1090; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1091;&#1078;&#1077; &#1073;&#1077;&#1079; &#1086;&#1096;&#1080;&#1073;&#1086;&#1082;. &#1055;&#1086;-&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; N .</p>
<p>&#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; :</p>
<pre class="lang:bash">exp user/manager@MZRB buffer=1200000 file=c:\MZRB.dmp log=c:\MZRB.log

</pre>
<p>&#1048;&#1084;&#1087;&#1086;&#1088;&#1090; :</p>
<pre class="lang:bash">imp user/manager@miac file=c:\MZRB.dmp log=c:\MZRB.log ignore=y fromuser=user touser=user

</pre>
<p>Data Pump:</p>
<pre class="lang:bash">expdp user/manager@MZRB schemas=USER directory=TEST_DIR dumpfile=MZRB.dmp logfile=impdpMZRB.log

</pre>
<pre class="lang:bash ">impdp user/manager@MZRB schemas=USER directory=TEST_DIR dumpfile=MZRB.dmp logfile=impdpMZRB.log

</pre>
<p>&#1044;&#1083;&#1103;&nbsp;Data Pump &#1074;&#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1085;&#1072;&#1076;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1102;.</p>
<pre class="lang:plsql">CREATE OR REPLACE DIRECTORY test_dir AS 'C:\TEST_DIR';
GRANT READ, WRITE ON DIRECTORY test_dir TO user;

</pre>
<p>Oracle&nbsp;Data&nbsp;Pump&nbsp;&mdash; &#1085;&#1086;&#1074;&#1072;&#1103;, &#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1099;&#1089;&#1090;&#1088;&#1072;&#1103; &#1080; &#1075;&#1080;&#1073;&#1082;&#1072;&#1103; &#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1072; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072;&#1084; &laquo;exp&raquo; &#1080; &laquo;imp&raquo;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1074;&#1096;&#1080;&#1084;&#1089;&#1103; &#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1093; Oracle. &#1042; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1084; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084; &#1080;&#1084;&#1087;&#1086;&#1088;&#1090;&#1072; &#1080; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072;,&nbsp;Data&nbsp;Pump&#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; PL/<acronym title="Structured Query Language">SQL</acronym>&nbsp;<acronym title="Application Programming Interface">API</acronym>&nbsp;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;.</p>
<p><span style="font-family: 'Lucida Grande', Verdana, Lucida, Helvetica, Arial, sans-serif; line-height: normal; text-align: justify; background-color: #ffffff;">&#1042; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1080; &#1086;&#1090; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090; exp &#1080; imp, &#1074;&#1089;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099;&nbsp;</span><span class="search_hit" style="padding: 0px; margin: 0px; background-color: #ffff99; font-family: 'Lucida Grande', Verdana, Lucida, Helvetica, Arial, sans-serif; line-height: normal; text-align: justify;">Data</span><span style="font-family: 'Lucida Grande', Verdana, Lucida, Helvetica, Arial, sans-serif; line-height: normal; text-align: justify; background-color: #ffffff;">&nbsp;</span><span class="search_hit" style="padding: 0px; margin: 0px; background-color: #ffff99; font-family: 'Lucida Grande', Verdana, Lucida, Helvetica, Arial, sans-serif; line-height: normal; text-align: justify;">Pump</span><span style="font-family: 'Lucida Grande', Verdana, Lucida, Helvetica, Arial, sans-serif; line-height: normal; text-align: justify; background-color: #ffffff;">: &#1080; &laquo;.dmp&raquo;, &#1080; &laquo;.log&raquo;, &mdash; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072; Oracle-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;, &#1072; &#1085;&#1077; &#1085;&#1072; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1089;&#1082;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;&#1077;.</span></p>
<p>&nbsp;</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
