<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN" "http://www.w3.org/TR/REC-html40/loose.dtd">
<html><body><div class="post-inner-content">
		<header class="entry-header page-header"><h1 class="entry-title ">&#1050;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1083;&#1072;&#1085;&#1072; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &mdash; Stored Outlines</h1>

			
<!-- .entry-meta -->
		</header><!-- .entry-header --><div class="entry-content">
			<p>&#1050;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1083;&#1072;&#1085;&#1072; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1073;&#1077;&#1079; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1076;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; Stored Outlines (&#1074;&#1089;&#1077;&#1075;&#1086; 4 &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;: Stored Outlines, SQL Profiles, SQL patch, SQL plan baseline).<br>
Stored Outlines &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1080;&#1090; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1080; &#1088;&#1077;&#1076;&#1072;&#1082;&#1094;&#1080;&#1081; Oracle &ndash; 9, 10, 11, EE, SE, XE.<br>
&#1042; Oracle 11g &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083; Stored Outlines &#1086;&#1092;&#1080;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085; &#1091;&#1089;&#1090;&#1072;&#1088;&#1077;&#1074;&#1096;&#1080;&#1084;, &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; SQL Plan Management (SQL plan baseline).<br>
&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1093;&#1080;&#1085;&#1090; &#1085;&#1077;&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081;, &#1085;&#1086; &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1080;&#1074;&#1085;&#1086; &#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1077; &#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1095;&#1091;&#1078;&#1072;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072;),<br>
&#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1085;&#1077; &#1084;&#1077;&#1085;&#1103;&#1103; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;, &#1079;&#1072;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1093;&#1080;&#1085;&#1090; (&#1093;&#1080;&#1085;&#1090;&#1099;) &#1074; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074; &#1077;&#1075;&#1086; &#1087;&#1086;&#1076;&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;&#1093;,<br>
&#1085;&#1072; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1093;&#1080;&#1085;&#1090; (&#1093;&#1080;&#1085;&#1090;&#1099;). &#1069;&#1090;&#1086; &#1087;&#1088;&#1080;&#1077;&#1084; &mdash; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1072; &#1093;&#1080;&#1085;&#1090;&#1086;&#1074; (&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1077;&#1085;, &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1096;&#1072;&#1073;&#1083;&#1086;&#1085;&#1086;&#1074; Stored Outlines).<br>
&#1053;&#1086; &#1090;&#1072;&#1082;&#1072;&#1103; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1076;&#1086; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072; &#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1072;&#1103; &#1087;&#1086;&#1076;&#1084;&#1077;&#1085;&#1072; &#1093;&#1080;&#1085;&#1090;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080;<br>
&#1082; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1089;&#1085;&#1080;&#1078;&#1077;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;.</p>
<p><span style="color: #008000;">&mdash;&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; public outline</span><br><strong><span style="color: #0000ff;">create public outline FNC_COUNTER_NOZ_OUTLINE4</span></strong><br><strong><span style="color: #0000ff;">on </span></strong><br><strong><span style="color: #0000ff;">SELECT&hellip;</span></strong></p>
<p><span style="color: #008000;">&mdash;&#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; UNUSED/USED</span><br><strong><span style="color: #0000ff;">select * from dba_outlines </span></strong><br><strong><span style="color: #0000ff;">select * from dba_outline_hints where name = &lsquo;FNC_COUNTER_NOZ_OUTLINE4&rsquo;</span></strong></p>
<p><span style="color: #008000;">&mdash; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; public outline, &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103; DEFAULT</span><br><strong><span style="color: #0000ff;">alter system set use_stored_outlines=true;</span></strong><br><strong><span style="color: #0000ff;">alter session set use_stored_outlines = true;</span></strong><br><span style="color: #008000;">&mdash;&nbsp;&#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100;</span><br><strong><span style="color: #0000ff;">alter system set use_stored_outlines=false;</span></strong><br><strong><span style="color: #0000ff;">alter session set use_stored_outlines = false;</span></strong></p>
<p><span style="color: #008000;">&mdash; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100;&nbsp;&#1074;&#1089;&#1077; outline &#1080;&#1079; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; DEFAULT</span><br><strong><span style="color: #0000ff;">BEGIN</span></strong><br><strong><span style="color: #0000ff;"> DBMS_OUTLN.drop_by_cat (cat =&gt; &lsquo;DEFAULT&rsquo;);</span></strong><br><strong><span style="color: #0000ff;">END;</span></strong><br><span style="color: #008000;">&mdash; &#1091;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1087;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102;</span><br><strong><span style="color: #0000ff;">drop public outline FNC_COUNTER_NOZ_OUTLINE4;</span></strong></p>
<p><span style="color: #008000;">&mdash;&#1076;&#1083;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1093;&#1080;&#1085;&#1090;&#1086;&#1074; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; private outline.</span><br><strong><span style="color: #0000ff;">select * from ol$;</span></strong><br><strong><span style="color: #0000ff;">select * from ol$hints;</span></strong><br><strong><span style="color: #0000ff;">select * from ol$nodes;</span></strong><br>
https://docs.oracle.com/cd/E15586_01/server.1111/e16638/outlines.htm<br>
http://oracle-base.com/articles/misc/outlines.php<br>
http://www.fors.ru/upload/magazine/05/http_texts/russia_ruoug_deev_sql_plans.html</p>
<p>&nbsp;</p>
					</div>
<!-- .entry-content -->

		<!-- .entry-meta --></div></body></html>
